app/views/projects/change.html.erb

SELECT "projecttypes".* FROM "projecttypes"
---
                <td>
                    <%= f.collection_select :protype_code, Projecttype.all, :protype_code, :protype_name, {}, {:include_blank => true, :disabled => true} %>

SELECT "languages".* FROM "languages"
---
                <td>
                    <%= f.collection_select :language_code, Language.all, :language_code, :language_name, :include_blank => true %>

SELECT "statuses".* FROM "statuses"
---
                <td>
                    <%= f.collection_select :status_code, Status.all, :status_code, :status_name, :include_blank => true %>