app/views/projects/list.html.erb

SELECT  "projecttypes".* FROM "projecttypes" WHERE "projecttypes"."protype_code" = $1 LIMIT $2  [["protype_code", "2"], ["LIMIT", 1]]
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."status_code" = $1 LIMIT $2  [["status_code", "3"], ["LIMIT", 1]]
---
                <td rowspan="2"><%= project.project_id.to_s.rjust(4, '0') %></td><td><%= project.start_date.strftime('%Y年%-m月%-d日') %></td><td><%= project.project_no %></td>
                <td><%= project.project_name %></td><td><%= Projecttype.find_by(:protype_code => project.protype_code).protype_name %></td>
                <td><%= Status.find_by(:status_code => project.status_code).status_name %></td><td><textarea><%= project.summary %></textarea></td>

SELECT  "languages".* FROM "languages" WHERE "languages"."language_code" = $1 LIMIT $2  [["language_code", "1"], ["LIMIT", 1]]
---
            <tr>
                <td><% if project.release_date != nil %><%= project.release_date.strftime('%Y年%-m月%-d日') %><% end %></td><td><%= Language.find_by(:language_code => project.language_code).language_name %></td><td><%= project.customer %></td><td><%= project.charge %></td>