app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
SELECT  1 AS one FROM "projects" LIMIT $1  [["LIMIT", 1]]
---
  def list
    @projects = Project.all
    if @projects.empty? then

SELECT  "project_sequences".* FROM "project_sequences" WHERE "project_sequences"."name" = $1 LIMIT $2  [["name", "sequence"], ["LIMIT", 1]]
---
      render '/projects/add'

    else
      if ProjectSequence.find_by(:name => 'sequence').number >= 10000 then

SELECT  "project_sequences".* FROM "project_sequences" WHERE "project_sequences"."name" = $1 LIMIT $2  [["name", "sequence"], ["LIMIT", 1]]
---
                                  reviewer:reviewer, release_date:releasedate, remarks:remarks)
        render '/projects/add'
      else
        @sequence = ProjectSequence.find_by(:name => 'sequence')

INSERT INTO "projects" ("project_id", "start_date", "project_no", "project_name", "protype_code", "language_code", "summary", "status_code", "customer", "charge", "reviewer", "release_date", "remarks") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "project_id"
---
        @project.reviewer = reviewer
        @project.release_date = releasedate
        @project.remarks = remarks
        @project.save

DELETE FROM "projects" WHERE "projects"."project_id" = $1  [["project_id", 6]]
SELECT  "projects".* FROM "projects" WHERE "projects"."project_id" = $1 LIMIT $2  [["project_id", 6], ["LIMIT", 1]]
---
  def delete
    Project.find_by(:project_id => params[:projectid]).delete

SELECT  "projects".* FROM "projects" WHERE "projects"."project_id" = $1 LIMIT $2  [["project_id", 6], ["LIMIT", 1]]
---
  def change
    flash[:changeerror] = ""
    @changeproject = Project.find_by(:project_id => params[:projectid])

SELECT  "projects".* FROM "projects" WHERE "projects"."project_id" = $1 LIMIT $2  [["project_id", 6], ["LIMIT", 1]]
---
  def editcheck
    @changeproject = Project.find_by(:project_id => params[:projectid])

UPDATE "projects" SET "release_date" = $1 WHERE "projects"."project_id" = $2  [["release_date", "2018-08-08"], ["project_id", 6]]
---
      flash[:changeerror] = flash[:changeerror][0..-2]
      render 'change.html.erb'
    else
      @changeproject.save