app/controllers/users_controller.rb

  def logincheck
    userid = params[:users]['userid']
    password = params[:users]['password']
    flash[:usererror] = ""
    if userid == "" then
      flash[:usererror] += "ユーザ名を入力してください。\n"
    elsif userid.length != 8 then
      flash[:usererror] += "ユーザ名は8桁で入力してください。\n"
    elsif userid !~ /^[0-9A-Za-z]+$/ then
      flash[:usererror] += "ユーザ名は半角英数字で入力してください。\n"
    end
    if password == "" then
      flash[:usererror] += "パスワードを入力してください。\n"
    end

    if flash[:usererror] != "" then
      flash[:usererror] = flash[:usererror][0..-2]
      @loginuser = Users.new(userid: userid)
      render 'login.html.erb'
    else
      @user = Users.find_by(:userid => userid)
---
SELECT  "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", ""], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."userid" = $1 LIMIT $2  [["userid", "testtest"], ["LIMIT", 1]]